{
  "ISTP-A": {
    "ocean": "O1 C1 E1 A1 N1",
    "mbti": "ISTP-A",
    "journal": "Strange ideas rarely lure me away from what already works. Schedules feel constraining; I value freedom to respond to the moment. Solitude restores me; I often need quiet time to recharge. I speak directly and prefer honesty over gentle sugarcoating. A calm mood carried me through ordinary tasks without drama. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ISTP-Qt": {
    "ocean": "O1 C1 E1 A1 N2",
    "mbti": "ISTP-Qt",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. Schedules feel constraining; I value freedom to respond to the moment. Solitude restores me; I often need quiet time to recharge. Practical solutions matter more to me than preserving feelings at all costs. There were moments of stress, but not enough to derail the day. Each note is a small map of my slow, steady changes."
  },
  "ISTP-T": {
    "ocean": "O1 C1 E1 A1 N3",
    "mbti": "ISTP-T",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I follow my instincts rather than sticking to tidy timetables. Solitude restores me; I often need quiet time to recharge. I speak directly and prefer honesty over gentle sugarcoating. My thoughts looped and I worried late into the night. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ISQfP-A": {
    "ocean": "O1 C1 E1 A2 N1",
    "mbti": "ISQfP-A",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. Schedules feel constraining; I value freedom to respond to the moment. I listen more than I speak and prefer thoughtful conversation to small talk. I care about people but I also keep clear boundaries. I slept well and my thoughts felt steady throughout the day. I tuck this away, grateful for the small lessons it holds."
  },
  "ISQfP-Qt": {
    "ocean": "O1 C1 E1 A2 N2",
    "mbti": "ISQfP-Qt",
    "journal": "Strange ideas rarely lure me away from what already works. I follow my instincts rather than sticking to tidy timetables. I listen more than I speak and prefer thoughtful conversation to small talk. I care about people but I also keep clear boundaries. There were moments of stress, but not enough to derail the day. I tuck this away, grateful for the small lessons it holds."
  },
  "ISQfP-T": {
    "ocean": "O1 C1 E1 A2 N3",
    "mbti": "ISQfP-T",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I follow my instincts rather than sticking to tidy timetables. Solitude restores me; I often need quiet time to recharge. I care about people but I also keep clear boundaries. My thoughts looped and I worried late into the night. I close the day feeling a little clearer about who I am."
  },
  "ISFP-A": {
    "ocean": "O1 C1 E1 A3 N1",
    "mbti": "ISFP-A",
    "journal": "I notice details most people miss, and find peace in the practical. I follow my instincts rather than sticking to tidy timetables. I listen more than I speak and prefer thoughtful conversation to small talk. I find meaning in creating warmth and support for friends and family. Small setbacks rolled off me easily and didn’t disturb my focus. Each note is a small map of my slow, steady changes."
  },
  "ISFP-Qt": {
    "ocean": "O1 C1 E1 A3 N2",
    "mbti": "ISFP-Qt",
    "journal": "Strange ideas rarely lure me away from what already works. I let the day unfold and trust momentum more than strict plans. Solitude restores me; I often need quiet time to recharge. I notice when others struggle and naturally step in to help. There were moments of stress, but not enough to derail the day. Writing this down feels like setting a small compass for tomorrow."
  },
  "ISFP-T": {
    "ocean": "O1 C1 E1 A3 N3",
    "mbti": "ISFP-T",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. Schedules feel constraining; I value freedom to respond to the moment. I find energy in reflection rather than crowds. I notice when others struggle and naturally step in to help. Anxiety kept me awake and made small problems feel very large. Each note is a small map of my slow, steady changes."
  },
  "QeSTP-A": {
    "ocean": "O1 C1 E2 A1 N1",
    "mbti": "QeSTP-A",
    "journal": "Strange ideas rarely lure me away from what already works. I let the day unfold and trust momentum more than strict plans. I move between social energy and quiet reflection, depending on the day. Practical solutions matter more to me than preserving feelings at all costs. Small setbacks rolled off me easily and didn’t disturb my focus. I tuck this away, grateful for the small lessons it holds."
  },
  "QeSTP-Qt": {
    "ocean": "O1 C1 E2 A1 N2",
    "mbti": "QeSTP-Qt",
    "journal": "Strange ideas rarely lure me away from what already works. I follow my instincts rather than sticking to tidy timetables. Sometimes I lead, sometimes I step back — both feel natural to me. I speak directly and prefer honesty over gentle sugarcoating. There were moments of stress, but not enough to derail the day. I close the day feeling a little clearer about who I am."
  },
  "QeSTP-T": {
    "ocean": "O1 C1 E2 A1 N3",
    "mbti": "QeSTP-T",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. Schedules feel constraining; I value freedom to respond to the moment. Sometimes I lead, sometimes I step back — both feel natural to me. I speak directly and prefer honesty over gentle sugarcoating. My thoughts looped and I worried late into the night. Writing this down feels like setting a small compass for tomorrow."
  },
  "QeSQfP-A": {
    "ocean": "O1 C1 E2 A2 N1",
    "mbti": "QeSQfP-A",
    "journal": "I notice details most people miss, and find peace in the practical. I follow my instincts rather than sticking to tidy timetables. I enjoy company but also value moments of solitude to regroup. I value both fairness and warmth, trying to balance them in action. A calm mood carried me through ordinary tasks without drama. I close the day feeling a little clearer about who I am."
  },
  "QeSQfP-Qt": {
    "ocean": "O1 C1 E2 A2 N2",
    "mbti": "QeSQfP-Qt",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I follow my instincts rather than sticking to tidy timetables. Sometimes I lead, sometimes I step back — both feel natural to me. I care about people but I also keep clear boundaries. I had a few worries that nudged at me, but I managed them sensibly. I tuck this away, grateful for the small lessons it holds."
  },
  "QeSQfP-T": {
    "ocean": "O1 C1 E2 A2 N3",
    "mbti": "QeSQfP-T",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. Schedules feel constraining; I value freedom to respond to the moment. I enjoy company but also value moments of solitude to regroup. I value both fairness and warmth, trying to balance them in action. My thoughts looped and I worried late into the night. Writing this down feels like setting a small compass for tomorrow."
  },
  "QeSFP-A": {
    "ocean": "O1 C1 E2 A3 N1",
    "mbti": "QeSFP-A",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I follow my instincts rather than sticking to tidy timetables. Sometimes I lead, sometimes I step back — both feel natural to me. Compassion guides many of my decisions, even the small ones. A calm mood carried me through ordinary tasks without drama. I close the day feeling a little clearer about who I am."
  },
  "QeSFP-Qt": {
    "ocean": "O1 C1 E2 A3 N2",
    "mbti": "QeSFP-Qt",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I follow my instincts rather than sticking to tidy timetables. Sometimes I lead, sometimes I step back — both feel natural to me. I notice when others struggle and naturally step in to help. There were moments of stress, but not enough to derail the day. Each note is a small map of my slow, steady changes."
  },
  "QeSFP-T": {
    "ocean": "O1 C1 E2 A3 N3",
    "mbti": "QeSFP-T",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. Schedules feel constraining; I value freedom to respond to the moment. I enjoy company but also value moments of solitude to regroup. Compassion guides many of my decisions, even the small ones. My thoughts looped and I worried late into the night. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ESTP-A": {
    "ocean": "O1 C1 E3 A1 N1",
    "mbti": "ESTP-A",
    "journal": "I notice details most people miss, and find peace in the practical. I let the day unfold and trust momentum more than strict plans. Connection with others lifts my mood and sharpens my focus. Practical solutions matter more to me than preserving feelings at all costs. Small setbacks rolled off me easily and didn’t disturb my focus. I tuck this away, grateful for the small lessons it holds."
  },
  "ESTP-Qt": {
    "ocean": "O1 C1 E3 A1 N2",
    "mbti": "ESTP-Qt",
    "journal": "I notice details most people miss, and find peace in the practical. I let the day unfold and trust momentum more than strict plans. Connection with others lifts my mood and sharpens my focus. Practical solutions matter more to me than preserving feelings at all costs. Some tension appeared, yet I found ways to ease it by evening. I close the day feeling a little clearer about who I am."
  },
  "ESTP-T": {
    "ocean": "O1 C1 E3 A1 N3",
    "mbti": "ESTP-T",
    "journal": "I notice details most people miss, and find peace in the practical. I let the day unfold and trust momentum more than strict plans. Connection with others lifts my mood and sharpens my focus. I speak directly and prefer honesty over gentle sugarcoating. My thoughts looped and I worried late into the night. I close the day feeling a little clearer about who I am."
  },
  "ESQfP-A": {
    "ocean": "O1 C1 E3 A2 N1",
    "mbti": "ESQfP-A",
    "journal": "I notice details most people miss, and find peace in the practical. I follow my instincts rather than sticking to tidy timetables. Being around people fuels me; I catch energy from laughter and chatter. I care about people but I also keep clear boundaries. I slept well and my thoughts felt steady throughout the day. Each note is a small map of my slow, steady changes."
  },
  "ESQfP-Qt": {
    "ocean": "O1 C1 E3 A2 N2",
    "mbti": "ESQfP-Qt",
    "journal": "Strange ideas rarely lure me away from what already works. Schedules feel constraining; I value freedom to respond to the moment. I often start conversations and find the center of the room energizing. I value both fairness and warmth, trying to balance them in action. I had a few worries that nudged at me, but I managed them sensibly. Each note is a small map of my slow, steady changes."
  },
  "ESQfP-T": {
    "ocean": "O1 C1 E3 A2 N3",
    "mbti": "ESQfP-T",
    "journal": "Strange ideas rarely lure me away from what already works. Schedules feel constraining; I value freedom to respond to the moment. Connection with others lifts my mood and sharpens my focus. I care about people but I also keep clear boundaries. Worry shadowed much of the day, making routine feel heavy. I tuck this away, grateful for the small lessons it holds."
  },
  "ESFP-A": {
    "ocean": "O1 C1 E3 A3 N1",
    "mbti": "ESFP-A",
    "journal": "I notice details most people miss, and find peace in the practical. Schedules feel constraining; I value freedom to respond to the moment. Connection with others lifts my mood and sharpens my focus. I notice when others struggle and naturally step in to help. I slept well and my thoughts felt steady throughout the day. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ESFP-Qt": {
    "ocean": "O1 C1 E3 A3 N2",
    "mbti": "ESFP-Qt",
    "journal": "Strange ideas rarely lure me away from what already works. I let the day unfold and trust momentum more than strict plans. Connection with others lifts my mood and sharpens my focus. I find meaning in creating warmth and support for friends and family. Some tension appeared, yet I found ways to ease it by evening. I close the day feeling a little clearer about who I am."
  },
  "ESFP-T": {
    "ocean": "O1 C1 E3 A3 N3",
    "mbti": "ESFP-T",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I follow my instincts rather than sticking to tidy timetables. Connection with others lifts my mood and sharpens my focus. I notice when others struggle and naturally step in to help. Anxiety kept me awake and made small problems feel very large. Writing this down feels like setting a small compass for tomorrow."
  },
  "ISTQj-A": {
    "ocean": "O1 C2 E1 A1 N1",
    "mbti": "ISTQj-A",
    "journal": "Strange ideas rarely lure me away from what already works. I aim for balance between schedules and spontaneity. Solitude restores me; I often need quiet time to recharge. I speak directly and prefer honesty over gentle sugarcoating. I slept well and my thoughts felt steady throughout the day. I close the day feeling a little clearer about who I am."
  },
  "ISTQj-Qt": {
    "ocean": "O1 C2 E1 A1 N2",
    "mbti": "ISTQj-Qt",
    "journal": "I notice details most people miss, and find peace in the practical. A flexible routine helps me stay productive without feeling boxed in. I listen more than I speak and prefer thoughtful conversation to small talk. I’m straightforward, which some find harsh but I call it clarity. Some tension appeared, yet I found ways to ease it by evening. I close the day feeling a little clearer about who I am."
  },
  "ISTQj-T": {
    "ocean": "O1 C2 E1 A1 N3",
    "mbti": "ISTQj-T",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. A flexible routine helps me stay productive without feeling boxed in. Solitude restores me; I often need quiet time to recharge. I’m straightforward, which some find harsh but I call it clarity. Anxiety kept me awake and made small problems feel very large. I close the day feeling a little clearer about who I am."
  },
  "ISQfQj-A": {
    "ocean": "O1 C2 E1 A2 N1",
    "mbti": "ISQfQj-A",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I set loose plans that keep me steady but allow room for change. Solitude restores me; I often need quiet time to recharge. I care about people but I also keep clear boundaries. A calm mood carried me through ordinary tasks without drama. Writing this down feels like setting a small compass for tomorrow."
  },
  "ISQfQj-Qt": {
    "ocean": "O1 C2 E1 A2 N2",
    "mbti": "ISQfQj-Qt",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I set loose plans that keep me steady but allow room for change. Solitude restores me; I often need quiet time to recharge. I value both fairness and warmth, trying to balance them in action. Some tension appeared, yet I found ways to ease it by evening. Each note is a small map of my slow, steady changes."
  },
  "ISQfQj-T": {
    "ocean": "O1 C2 E1 A2 N3",
    "mbti": "ISQfQj-T",
    "journal": "I notice details most people miss, and find peace in the practical. A flexible routine helps me stay productive without feeling boxed in. I listen more than I speak and prefer thoughtful conversation to small talk. I try to be kind while also being honest about what I need. Worry shadowed much of the day, making routine feel heavy. Writing this down feels like setting a small compass for tomorrow."
  },
  "ISFQj-A": {
    "ocean": "O1 C2 E1 A3 N1",
    "mbti": "ISFQj-A",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. A flexible routine helps me stay productive without feeling boxed in. I listen more than I speak and prefer thoughtful conversation to small talk. Compassion guides many of my decisions, even the small ones. I slept well and my thoughts felt steady throughout the day. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ISFQj-Qt": {
    "ocean": "O1 C2 E1 A3 N2",
    "mbti": "ISFQj-Qt",
    "journal": "I notice details most people miss, and find peace in the practical. A flexible routine helps me stay productive without feeling boxed in. I find energy in reflection rather than crowds. I notice when others struggle and naturally step in to help. Some tension appeared, yet I found ways to ease it by evening. I close the day feeling a little clearer about who I am."
  },
  "ISFQj-T": {
    "ocean": "O1 C2 E1 A3 N3",
    "mbti": "ISFQj-T",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I aim for balance between schedules and spontaneity. I find energy in reflection rather than crowds. Compassion guides many of my decisions, even the small ones. My thoughts looped and I worried late into the night. I tuck this away, grateful for the small lessons it holds."
  },
  "QeSTQj-A": {
    "ocean": "O1 C2 E2 A1 N1",
    "mbti": "QeSTQj-A",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. A flexible routine helps me stay productive without feeling boxed in. I enjoy company but also value moments of solitude to regroup. I speak directly and prefer honesty over gentle sugarcoating. A calm mood carried me through ordinary tasks without drama. Each note is a small map of my slow, steady changes."
  },
  "QeSTQj-Qt": {
    "ocean": "O1 C2 E2 A1 N2",
    "mbti": "QeSTQj-Qt",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. A flexible routine helps me stay productive without feeling boxed in. I move between social energy and quiet reflection, depending on the day. Practical solutions matter more to me than preserving feelings at all costs. There were moments of stress, but not enough to derail the day. Each note is a small map of my slow, steady changes."
  },
  "QeSTQj-T": {
    "ocean": "O1 C2 E2 A1 N3",
    "mbti": "QeSTQj-T",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I aim for balance between schedules and spontaneity. I enjoy company but also value moments of solitude to regroup. Practical solutions matter more to me than preserving feelings at all costs. My thoughts looped and I worried late into the night. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "QeSQfQj-A": {
    "ocean": "O1 C2 E2 A2 N1",
    "mbti": "QeSQfQj-A",
    "journal": "I notice details most people miss, and find peace in the practical. I aim for balance between schedules and spontaneity. I move between social energy and quiet reflection, depending on the day. I try to be kind while also being honest about what I need. A calm mood carried me through ordinary tasks without drama. I close the day feeling a little clearer about who I am."
  },
  "QeSQfQj-Qt": {
    "ocean": "O1 C2 E2 A2 N2",
    "mbti": "QeSQfQj-Qt",
    "journal": "Strange ideas rarely lure me away from what already works. I aim for balance between schedules and spontaneity. I enjoy company but also value moments of solitude to regroup. I value both fairness and warmth, trying to balance them in action. There were moments of stress, but not enough to derail the day. Writing this down feels like setting a small compass for tomorrow."
  },
  "QeSQfQj-T": {
    "ocean": "O1 C2 E2 A2 N3",
    "mbti": "QeSQfQj-T",
    "journal": "I notice details most people miss, and find peace in the practical. I set loose plans that keep me steady but allow room for change. I enjoy company but also value moments of solitude to regroup. I try to be kind while also being honest about what I need. My thoughts looped and I worried late into the night. I tuck this away, grateful for the small lessons it holds."
  },
  "QeSFQj-A": {
    "ocean": "O1 C2 E2 A3 N1",
    "mbti": "QeSFQj-A",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I aim for balance between schedules and spontaneity. Sometimes I lead, sometimes I step back — both feel natural to me. Compassion guides many of my decisions, even the small ones. Small setbacks rolled off me easily and didn’t disturb my focus. Writing this down feels like setting a small compass for tomorrow."
  },
  "QeSFQj-Qt": {
    "ocean": "O1 C2 E2 A3 N2",
    "mbti": "QeSFQj-Qt",
    "journal": "Strange ideas rarely lure me away from what already works. A flexible routine helps me stay productive without feeling boxed in. Sometimes I lead, sometimes I step back — both feel natural to me. I find meaning in creating warmth and support for friends and family. I had a few worries that nudged at me, but I managed them sensibly. I tuck this away, grateful for the small lessons it holds."
  },
  "QeSFQj-T": {
    "ocean": "O1 C2 E2 A3 N3",
    "mbti": "QeSFQj-T",
    "journal": "Strange ideas rarely lure me away from what already works. A flexible routine helps me stay productive without feeling boxed in. I enjoy company but also value moments of solitude to regroup. I find meaning in creating warmth and support for friends and family. My thoughts looped and I worried late into the night. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ESTQj-A": {
    "ocean": "O1 C2 E3 A1 N1",
    "mbti": "ESTQj-A",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I set loose plans that keep me steady but allow room for change. I often start conversations and find the center of the room energizing. I’m straightforward, which some find harsh but I call it clarity. Small setbacks rolled off me easily and didn’t disturb my focus. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ESTQj-Qt": {
    "ocean": "O1 C2 E3 A1 N2",
    "mbti": "ESTQj-Qt",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I aim for balance between schedules and spontaneity. I often start conversations and find the center of the room energizing. I speak directly and prefer honesty over gentle sugarcoating. I had a few worries that nudged at me, but I managed them sensibly. I tuck this away, grateful for the small lessons it holds."
  },
  "ESTQj-T": {
    "ocean": "O1 C2 E3 A1 N3",
    "mbti": "ESTQj-T",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I set loose plans that keep me steady but allow room for change. Being around people fuels me; I catch energy from laughter and chatter. Practical solutions matter more to me than preserving feelings at all costs. Anxiety kept me awake and made small problems feel very large. I close the day feeling a little clearer about who I am."
  },
  "ESQfQj-A": {
    "ocean": "O1 C2 E3 A2 N1",
    "mbti": "ESQfQj-A",
    "journal": "I notice details most people miss, and find peace in the practical. I aim for balance between schedules and spontaneity. I often start conversations and find the center of the room energizing. I value both fairness and warmth, trying to balance them in action. Small setbacks rolled off me easily and didn’t disturb my focus. I tuck this away, grateful for the small lessons it holds."
  },
  "ESQfQj-Qt": {
    "ocean": "O1 C2 E3 A2 N2",
    "mbti": "ESQfQj-Qt",
    "journal": "Strange ideas rarely lure me away from what already works. I aim for balance between schedules and spontaneity. Connection with others lifts my mood and sharpens my focus. I value both fairness and warmth, trying to balance them in action. There were moments of stress, but not enough to derail the day. Each note is a small map of my slow, steady changes."
  },
  "ESQfQj-T": {
    "ocean": "O1 C2 E3 A2 N3",
    "mbti": "ESQfQj-T",
    "journal": "I notice details most people miss, and find peace in the practical. I aim for balance between schedules and spontaneity. Being around people fuels me; I catch energy from laughter and chatter. I care about people but I also keep clear boundaries. Anxiety kept me awake and made small problems feel very large. I close the day feeling a little clearer about who I am."
  },
  "ESFQj-A": {
    "ocean": "O1 C2 E3 A3 N1",
    "mbti": "ESFQj-A",
    "journal": "I notice details most people miss, and find peace in the practical. I set loose plans that keep me steady but allow room for change. I often start conversations and find the center of the room energizing. Compassion guides many of my decisions, even the small ones. A calm mood carried me through ordinary tasks without drama. Writing this down feels like setting a small compass for tomorrow."
  },
  "ESFQj-Qt": {
    "ocean": "O1 C2 E3 A3 N2",
    "mbti": "ESFQj-Qt",
    "journal": "I notice details most people miss, and find peace in the practical. A flexible routine helps me stay productive without feeling boxed in. Being around people fuels me; I catch energy from laughter and chatter. I find meaning in creating warmth and support for friends and family. Some tension appeared, yet I found ways to ease it by evening. Writing this down feels like setting a small compass for tomorrow."
  },
  "ESFQj-T": {
    "ocean": "O1 C2 E3 A3 N3",
    "mbti": "ESFQj-T",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I set loose plans that keep me steady but allow room for change. I often start conversations and find the center of the room energizing. Compassion guides many of my decisions, even the small ones. Worry shadowed much of the day, making routine feel heavy. Writing this down feels like setting a small compass for tomorrow."
  },
  "ISTJ-A": {
    "ocean": "O1 C3 E1 A1 N1",
    "mbti": "ISTJ-A",
    "journal": "I notice details most people miss, and find peace in the practical. I get satisfaction from finishing tasks and keeping clear lists. I find energy in reflection rather than crowds. I’m straightforward, which some find harsh but I call it clarity. I slept well and my thoughts felt steady throughout the day. Writing this down feels like setting a small compass for tomorrow."
  },
  "ISTJ-Qt": {
    "ocean": "O1 C3 E1 A1 N2",
    "mbti": "ISTJ-Qt",
    "journal": "Strange ideas rarely lure me away from what already works. I like to measure progress and tidy up unfinished work. I listen more than I speak and prefer thoughtful conversation to small talk. I speak directly and prefer honesty over gentle sugarcoating. Some tension appeared, yet I found ways to ease it by evening. Writing this down feels like setting a small compass for tomorrow."
  },
  "ISTJ-T": {
    "ocean": "O1 C3 E1 A1 N3",
    "mbti": "ISTJ-T",
    "journal": "Strange ideas rarely lure me away from what already works. I get satisfaction from finishing tasks and keeping clear lists. Solitude restores me; I often need quiet time to recharge. Practical solutions matter more to me than preserving feelings at all costs. My thoughts looped and I worried late into the night. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ISQfJ-A": {
    "ocean": "O1 C3 E1 A2 N1",
    "mbti": "ISQfJ-A",
    "journal": "I notice details most people miss, and find peace in the practical. I get satisfaction from finishing tasks and keeping clear lists. Solitude restores me; I often need quiet time to recharge. I care about people but I also keep clear boundaries. Small setbacks rolled off me easily and didn’t disturb my focus. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ISQfJ-Qt": {
    "ocean": "O1 C3 E1 A2 N2",
    "mbti": "ISQfJ-Qt",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I like to measure progress and tidy up unfinished work. I listen more than I speak and prefer thoughtful conversation to small talk. I value both fairness and warmth, trying to balance them in action. There were moments of stress, but not enough to derail the day. I close the day feeling a little clearer about who I am."
  },
  "ISQfJ-T": {
    "ocean": "O1 C3 E1 A2 N3",
    "mbti": "ISQfJ-T",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I like to measure progress and tidy up unfinished work. I listen more than I speak and prefer thoughtful conversation to small talk. I try to be kind while also being honest about what I need. Anxiety kept me awake and made small problems feel very large. Each note is a small map of my slow, steady changes."
  },
  "ISFJ-A": {
    "ocean": "O1 C3 E1 A3 N1",
    "mbti": "ISFJ-A",
    "journal": "Strange ideas rarely lure me away from what already works. I get satisfaction from finishing tasks and keeping clear lists. Solitude restores me; I often need quiet time to recharge. Compassion guides many of my decisions, even the small ones. I slept well and my thoughts felt steady throughout the day. I close the day feeling a little clearer about who I am."
  },
  "ISFJ-Qt": {
    "ocean": "O1 C3 E1 A3 N2",
    "mbti": "ISFJ-Qt",
    "journal": "Strange ideas rarely lure me away from what already works. Plans anchor me; I break big goals into small, achievable steps. I find energy in reflection rather than crowds. I notice when others struggle and naturally step in to help. There were moments of stress, but not enough to derail the day. I close the day feeling a little clearer about who I am."
  },
  "ISFJ-T": {
    "ocean": "O1 C3 E1 A3 N3",
    "mbti": "ISFJ-T",
    "journal": "I notice details most people miss, and find peace in the practical. I get satisfaction from finishing tasks and keeping clear lists. I find energy in reflection rather than crowds. I notice when others struggle and naturally step in to help. Anxiety kept me awake and made small problems feel very large. I tuck this away, grateful for the small lessons it holds."
  },
  "QeSTJ-A": {
    "ocean": "O1 C3 E2 A1 N1",
    "mbti": "QeSTJ-A",
    "journal": "Strange ideas rarely lure me away from what already works. I get satisfaction from finishing tasks and keeping clear lists. I move between social energy and quiet reflection, depending on the day. Practical solutions matter more to me than preserving feelings at all costs. A calm mood carried me through ordinary tasks without drama. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "QeSTJ-Qt": {
    "ocean": "O1 C3 E2 A1 N2",
    "mbti": "QeSTJ-Qt",
    "journal": "I notice details most people miss, and find peace in the practical. Plans anchor me; I break big goals into small, achievable steps. I enjoy company but also value moments of solitude to regroup. I speak directly and prefer honesty over gentle sugarcoating. Some tension appeared, yet I found ways to ease it by evening. Each note is a small map of my slow, steady changes."
  },
  "QeSTJ-T": {
    "ocean": "O1 C3 E2 A1 N3",
    "mbti": "QeSTJ-T",
    "journal": "I notice details most people miss, and find peace in the practical. Plans anchor me; I break big goals into small, achievable steps. Sometimes I lead, sometimes I step back — both feel natural to me. I speak directly and prefer honesty over gentle sugarcoating. My thoughts looped and I worried late into the night. I tuck this away, grateful for the small lessons it holds."
  },
  "QeSQfJ-A": {
    "ocean": "O1 C3 E2 A2 N1",
    "mbti": "QeSQfJ-A",
    "journal": "Strange ideas rarely lure me away from what already works. I get satisfaction from finishing tasks and keeping clear lists. I enjoy company but also value moments of solitude to regroup. I care about people but I also keep clear boundaries. I slept well and my thoughts felt steady throughout the day. Each note is a small map of my slow, steady changes."
  },
  "QeSQfJ-Qt": {
    "ocean": "O1 C3 E2 A2 N2",
    "mbti": "QeSQfJ-Qt",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I like to measure progress and tidy up unfinished work. Sometimes I lead, sometimes I step back — both feel natural to me. I care about people but I also keep clear boundaries. There were moments of stress, but not enough to derail the day. I close the day feeling a little clearer about who I am."
  },
  "QeSQfJ-T": {
    "ocean": "O1 C3 E2 A2 N3",
    "mbti": "QeSQfJ-T",
    "journal": "Strange ideas rarely lure me away from what already works. Plans anchor me; I break big goals into small, achievable steps. I move between social energy and quiet reflection, depending on the day. I try to be kind while also being honest about what I need. Worry shadowed much of the day, making routine feel heavy. Each note is a small map of my slow, steady changes."
  },
  "QeSFJ-A": {
    "ocean": "O1 C3 E2 A3 N1",
    "mbti": "QeSFJ-A",
    "journal": "Strange ideas rarely lure me away from what already works. Plans anchor me; I break big goals into small, achievable steps. Sometimes I lead, sometimes I step back — both feel natural to me. I notice when others struggle and naturally step in to help. A calm mood carried me through ordinary tasks without drama. Each note is a small map of my slow, steady changes."
  },
  "QeSFJ-Qt": {
    "ocean": "O1 C3 E2 A3 N2",
    "mbti": "QeSFJ-Qt",
    "journal": "Strange ideas rarely lure me away from what already works. I like to measure progress and tidy up unfinished work. I move between social energy and quiet reflection, depending on the day. Compassion guides many of my decisions, even the small ones. Some tension appeared, yet I found ways to ease it by evening. I tuck this away, grateful for the small lessons it holds."
  },
  "QeSFJ-T": {
    "ocean": "O1 C3 E2 A3 N3",
    "mbti": "QeSFJ-T",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. Plans anchor me; I break big goals into small, achievable steps. Sometimes I lead, sometimes I step back — both feel natural to me. I notice when others struggle and naturally step in to help. Anxiety kept me awake and made small problems feel very large. I tuck this away, grateful for the small lessons it holds."
  },
  "ESTJ-A": {
    "ocean": "O1 C3 E3 A1 N1",
    "mbti": "ESTJ-A",
    "journal": "I prefer the comfort of familiar rhythms and small, dependable pleasures. I get satisfaction from finishing tasks and keeping clear lists. I often start conversations and find the center of the room energizing. Practical solutions matter more to me than preserving feelings at all costs. I slept well and my thoughts felt steady throughout the day. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ESTJ-Qt": {
    "ocean": "O1 C3 E3 A1 N2",
    "mbti": "ESTJ-Qt",
    "journal": "Strange ideas rarely lure me away from what already works. I like to measure progress and tidy up unfinished work. I often start conversations and find the center of the room energizing. I speak directly and prefer honesty over gentle sugarcoating. I had a few worries that nudged at me, but I managed them sensibly. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ESTJ-T": {
    "ocean": "O1 C3 E3 A1 N3",
    "mbti": "ESTJ-T",
    "journal": "I notice details most people miss, and find peace in the practical. Plans anchor me; I break big goals into small, achievable steps. Being around people fuels me; I catch energy from laughter and chatter. Practical solutions matter more to me than preserving feelings at all costs. My thoughts looped and I worried late into the night. Each note is a small map of my slow, steady changes."
  },
  "ESQfJ-A": {
    "ocean": "O1 C3 E3 A2 N1",
    "mbti": "ESQfJ-A",
    "journal": "I notice details most people miss, and find peace in the practical. Plans anchor me; I break big goals into small, achievable steps. I often start conversations and find the center of the room energizing. I value both fairness and warmth, trying to balance them in action. I slept well and my thoughts felt steady throughout the day. I close the day feeling a little clearer about who I am."
  },
  "ESQfJ-Qt": {
    "ocean": "O1 C3 E3 A2 N2",
    "mbti": "ESQfJ-Qt",
    "journal": "I notice details most people miss, and find peace in the practical. I like to measure progress and tidy up unfinished work. Connection with others lifts my mood and sharpens my focus. I value both fairness and warmth, trying to balance them in action. I had a few worries that nudged at me, but I managed them sensibly. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ESQfJ-T": {
    "ocean": "O1 C3 E3 A2 N3",
    "mbti": "ESQfJ-T",
    "journal": "I notice details most people miss, and find peace in the practical. I like to measure progress and tidy up unfinished work. Being around people fuels me; I catch energy from laughter and chatter. I value both fairness and warmth, trying to balance them in action. Worry shadowed much of the day, making routine feel heavy. I tuck this away, grateful for the small lessons it holds."
  },
  "ESFJ-A": {
    "ocean": "O1 C3 E3 A3 N1",
    "mbti": "ESFJ-A",
    "journal": "Strange ideas rarely lure me away from what already works. Plans anchor me; I break big goals into small, achievable steps. Connection with others lifts my mood and sharpens my focus. I notice when others struggle and naturally step in to help. A calm mood carried me through ordinary tasks without drama. Writing this down feels like setting a small compass for tomorrow."
  },
  "ESFJ-Qt": {
    "ocean": "O1 C3 E3 A3 N2",
    "mbti": "ESFJ-Qt",
    "journal": "I notice details most people miss, and find peace in the practical. I like to measure progress and tidy up unfinished work. I often start conversations and find the center of the room energizing. I find meaning in creating warmth and support for friends and family. I had a few worries that nudged at me, but I managed them sensibly. Each note is a small map of my slow, steady changes."
  },
  "ESFJ-T": {
    "ocean": "O1 C3 E3 A3 N3",
    "mbti": "ESFJ-T",
    "journal": "I notice details most people miss, and find peace in the practical. Plans anchor me; I break big goals into small, achievable steps. I often start conversations and find the center of the room energizing. Compassion guides many of my decisions, even the small ones. My thoughts looped and I worried late into the night. Writing this down feels like setting a small compass for tomorrow."
  },
  "IQnTP-A": {
    "ocean": "O2 C1 E1 A1 N1",
    "mbti": "IQnTP-A",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I let the day unfold and trust momentum more than strict plans. I listen more than I speak and prefer thoughtful conversation to small talk. I speak directly and prefer honesty over gentle sugarcoating. A calm mood carried me through ordinary tasks without drama. I close the day feeling a little clearer about who I am."
  },
  "IQnTP-Qt": {
    "ocean": "O2 C1 E1 A1 N2",
    "mbti": "IQnTP-Qt",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. I follow my instincts rather than sticking to tidy timetables. I find energy in reflection rather than crowds. I speak directly and prefer honesty over gentle sugarcoating. Some tension appeared, yet I found ways to ease it by evening. I tuck this away, grateful for the small lessons it holds."
  },
  "IQnTP-T": {
    "ocean": "O2 C1 E1 A1 N3",
    "mbti": "IQnTP-T",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I let the day unfold and trust momentum more than strict plans. I find energy in reflection rather than crowds. I’m straightforward, which some find harsh but I call it clarity. Worry shadowed much of the day, making routine feel heavy. I tuck this away, grateful for the small lessons it holds."
  },
  "IQnQfP-A": {
    "ocean": "O2 C1 E1 A2 N1",
    "mbti": "IQnQfP-A",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I let the day unfold and trust momentum more than strict plans. Solitude restores me; I often need quiet time to recharge. I value both fairness and warmth, trying to balance them in action. I slept well and my thoughts felt steady throughout the day. Writing this down feels like setting a small compass for tomorrow."
  },
  "IQnQfP-Qt": {
    "ocean": "O2 C1 E1 A2 N2",
    "mbti": "IQnQfP-Qt",
    "journal": "I like ideas that blend imagination with usefulness. Schedules feel constraining; I value freedom to respond to the moment. I listen more than I speak and prefer thoughtful conversation to small talk. I try to be kind while also being honest about what I need. There were moments of stress, but not enough to derail the day. I tuck this away, grateful for the small lessons it holds."
  },
  "IQnQfP-T": {
    "ocean": "O2 C1 E1 A2 N3",
    "mbti": "IQnQfP-T",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. I follow my instincts rather than sticking to tidy timetables. I listen more than I speak and prefer thoughtful conversation to small talk. I value both fairness and warmth, trying to balance them in action. Worry shadowed much of the day, making routine feel heavy. I tuck this away, grateful for the small lessons it holds."
  },
  "IQnFP-A": {
    "ocean": "O2 C1 E1 A3 N1",
    "mbti": "IQnFP-A",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. I follow my instincts rather than sticking to tidy timetables. I listen more than I speak and prefer thoughtful conversation to small talk. Compassion guides many of my decisions, even the small ones. Small setbacks rolled off me easily and didn’t disturb my focus. Each note is a small map of my slow, steady changes."
  },
  "IQnFP-Qt": {
    "ocean": "O2 C1 E1 A3 N2",
    "mbti": "IQnFP-Qt",
    "journal": "I like ideas that blend imagination with usefulness. Schedules feel constraining; I value freedom to respond to the moment. Solitude restores me; I often need quiet time to recharge. I notice when others struggle and naturally step in to help. There were moments of stress, but not enough to derail the day. Writing this down feels like setting a small compass for tomorrow."
  },
  "IQnFP-T": {
    "ocean": "O2 C1 E1 A3 N3",
    "mbti": "IQnFP-T",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. I let the day unfold and trust momentum more than strict plans. I find energy in reflection rather than crowds. I notice when others struggle and naturally step in to help. My thoughts looped and I worried late into the night. I close the day feeling a little clearer about who I am."
  },
  "QeQnTP-A": {
    "ocean": "O2 C1 E2 A1 N1",
    "mbti": "QeQnTP-A",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I let the day unfold and trust momentum more than strict plans. Sometimes I lead, sometimes I step back — both feel natural to me. I speak directly and prefer honesty over gentle sugarcoating. I slept well and my thoughts felt steady throughout the day. Writing this down feels like setting a small compass for tomorrow."
  },
  "QeQnTP-Qt": {
    "ocean": "O2 C1 E2 A1 N2",
    "mbti": "QeQnTP-Qt",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. Schedules feel constraining; I value freedom to respond to the moment. I enjoy company but also value moments of solitude to regroup. I speak directly and prefer honesty over gentle sugarcoating. I had a few worries that nudged at me, but I managed them sensibly. Writing this down feels like setting a small compass for tomorrow."
  },
  "QeQnTP-T": {
    "ocean": "O2 C1 E2 A1 N3",
    "mbti": "QeQnTP-T",
    "journal": "I like ideas that blend imagination with usefulness. I let the day unfold and trust momentum more than strict plans. I move between social energy and quiet reflection, depending on the day. I speak directly and prefer honesty over gentle sugarcoating. Worry shadowed much of the day, making routine feel heavy. Each note is a small map of my slow, steady changes."
  },
  "QeQnQfP-A": {
    "ocean": "O2 C1 E2 A2 N1",
    "mbti": "QeQnQfP-A",
    "journal": "I like ideas that blend imagination with usefulness. I follow my instincts rather than sticking to tidy timetables. I move between social energy and quiet reflection, depending on the day. I try to be kind while also being honest about what I need. A calm mood carried me through ordinary tasks without drama. Each note is a small map of my slow, steady changes."
  },
  "QeQnQfP-Qt": {
    "ocean": "O2 C1 E2 A2 N2",
    "mbti": "QeQnQfP-Qt",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. I follow my instincts rather than sticking to tidy timetables. I move between social energy and quiet reflection, depending on the day. I value both fairness and warmth, trying to balance them in action. I had a few worries that nudged at me, but I managed them sensibly. I tuck this away, grateful for the small lessons it holds."
  },
  "QeQnQfP-T": {
    "ocean": "O2 C1 E2 A2 N3",
    "mbti": "QeQnQfP-T",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I follow my instincts rather than sticking to tidy timetables. I enjoy company but also value moments of solitude to regroup. I care about people but I also keep clear boundaries. My thoughts looped and I worried late into the night. I close the day feeling a little clearer about who I am."
  },
  "QeQnFP-A": {
    "ocean": "O2 C1 E2 A3 N1",
    "mbti": "QeQnFP-A",
    "journal": "I like ideas that blend imagination with usefulness. I let the day unfold and trust momentum more than strict plans. I enjoy company but also value moments of solitude to regroup. Compassion guides many of my decisions, even the small ones. Small setbacks rolled off me easily and didn’t disturb my focus. Each note is a small map of my slow, steady changes."
  },
  "QeQnFP-Qt": {
    "ocean": "O2 C1 E2 A3 N2",
    "mbti": "QeQnFP-Qt",
    "journal": "I like ideas that blend imagination with usefulness. I let the day unfold and trust momentum more than strict plans. Sometimes I lead, sometimes I step back — both feel natural to me. Compassion guides many of my decisions, even the small ones. I had a few worries that nudged at me, but I managed them sensibly. I tuck this away, grateful for the small lessons it holds."
  },
  "QeQnFP-T": {
    "ocean": "O2 C1 E2 A3 N3",
    "mbti": "QeQnFP-T",
    "journal": "I like ideas that blend imagination with usefulness. Schedules feel constraining; I value freedom to respond to the moment. I move between social energy and quiet reflection, depending on the day. I find meaning in creating warmth and support for friends and family. My thoughts looped and I worried late into the night. Writing this down feels like setting a small compass for tomorrow."
  },
  "EQnTP-A": {
    "ocean": "O2 C1 E3 A1 N1",
    "mbti": "EQnTP-A",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. Schedules feel constraining; I value freedom to respond to the moment. I often start conversations and find the center of the room energizing. Practical solutions matter more to me than preserving feelings at all costs. I slept well and my thoughts felt steady throughout the day. Writing this down feels like setting a small compass for tomorrow."
  },
  "EQnTP-Qt": {
    "ocean": "O2 C1 E3 A1 N2",
    "mbti": "EQnTP-Qt",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. Schedules feel constraining; I value freedom to respond to the moment. I often start conversations and find the center of the room energizing. I’m straightforward, which some find harsh but I call it clarity. There were moments of stress, but not enough to derail the day. I close the day feeling a little clearer about who I am."
  },
  "EQnTP-T": {
    "ocean": "O2 C1 E3 A1 N3",
    "mbti": "EQnTP-T",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I let the day unfold and trust momentum more than strict plans. Connection with others lifts my mood and sharpens my focus. I’m straightforward, which some find harsh but I call it clarity. Worry shadowed much of the day, making routine feel heavy. I tuck this away, grateful for the small lessons it holds."
  },
  "EQnQfP-A": {
    "ocean": "O2 C1 E3 A2 N1",
    "mbti": "EQnQfP-A",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. I follow my instincts rather than sticking to tidy timetables. I often start conversations and find the center of the room energizing. I try to be kind while also being honest about what I need. A calm mood carried me through ordinary tasks without drama. I close the day feeling a little clearer about who I am."
  },
  "EQnQfP-Qt": {
    "ocean": "O2 C1 E3 A2 N2",
    "mbti": "EQnQfP-Qt",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. I let the day unfold and trust momentum more than strict plans. Being around people fuels me; I catch energy from laughter and chatter. I care about people but I also keep clear boundaries. There were moments of stress, but not enough to derail the day. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "EQnQfP-T": {
    "ocean": "O2 C1 E3 A2 N3",
    "mbti": "EQnQfP-T",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. Schedules feel constraining; I value freedom to respond to the moment. Connection with others lifts my mood and sharpens my focus. I try to be kind while also being honest about what I need. My thoughts looped and I worried late into the night. I close the day feeling a little clearer about who I am."
  },
  "EQnFP-A": {
    "ocean": "O2 C1 E3 A3 N1",
    "mbti": "EQnFP-A",
    "journal": "I like ideas that blend imagination with usefulness. I let the day unfold and trust momentum more than strict plans. Connection with others lifts my mood and sharpens my focus. I notice when others struggle and naturally step in to help. A calm mood carried me through ordinary tasks without drama. I close the day feeling a little clearer about who I am."
  },
  "EQnFP-Qt": {
    "ocean": "O2 C1 E3 A3 N2",
    "mbti": "EQnFP-Qt",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I follow my instincts rather than sticking to tidy timetables. I often start conversations and find the center of the room energizing. I notice when others struggle and naturally step in to help. I had a few worries that nudged at me, but I managed them sensibly. I close the day feeling a little clearer about who I am."
  },
  "EQnFP-T": {
    "ocean": "O2 C1 E3 A3 N3",
    "mbti": "EQnFP-T",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I let the day unfold and trust momentum more than strict plans. Connection with others lifts my mood and sharpens my focus. I find meaning in creating warmth and support for friends and family. Anxiety kept me awake and made small problems feel very large. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "IQnTQj-A": {
    "ocean": "O2 C2 E1 A1 N1",
    "mbti": "IQnTQj-A",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I aim for balance between schedules and spontaneity. I find energy in reflection rather than crowds. I speak directly and prefer honesty over gentle sugarcoating. A calm mood carried me through ordinary tasks without drama. I tuck this away, grateful for the small lessons it holds."
  },
  "IQnTQj-Qt": {
    "ocean": "O2 C2 E1 A1 N2",
    "mbti": "IQnTQj-Qt",
    "journal": "I like ideas that blend imagination with usefulness. A flexible routine helps me stay productive without feeling boxed in. I listen more than I speak and prefer thoughtful conversation to small talk. I speak directly and prefer honesty over gentle sugarcoating. Some tension appeared, yet I found ways to ease it by evening. Each note is a small map of my slow, steady changes."
  },
  "IQnTQj-T": {
    "ocean": "O2 C2 E1 A1 N3",
    "mbti": "IQnTQj-T",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. I aim for balance between schedules and spontaneity. I find energy in reflection rather than crowds. I speak directly and prefer honesty over gentle sugarcoating. Anxiety kept me awake and made small problems feel very large. Each note is a small map of my slow, steady changes."
  },
  "IQnQfQj-A": {
    "ocean": "O2 C2 E1 A2 N1",
    "mbti": "IQnQfQj-A",
    "journal": "I like ideas that blend imagination with usefulness. I set loose plans that keep me steady but allow room for change. Solitude restores me; I often need quiet time to recharge. I try to be kind while also being honest about what I need. Small setbacks rolled off me easily and didn’t disturb my focus. I tuck this away, grateful for the small lessons it holds."
  },
  "IQnQfQj-Qt": {
    "ocean": "O2 C2 E1 A2 N2",
    "mbti": "IQnQfQj-Qt",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I aim for balance between schedules and spontaneity. I find energy in reflection rather than crowds. I care about people but I also keep clear boundaries. I had a few worries that nudged at me, but I managed them sensibly. I tuck this away, grateful for the small lessons it holds."
  },
  "IQnQfQj-T": {
    "ocean": "O2 C2 E1 A2 N3",
    "mbti": "IQnQfQj-T",
    "journal": "I like ideas that blend imagination with usefulness. I set loose plans that keep me steady but allow room for change. Solitude restores me; I often need quiet time to recharge. I care about people but I also keep clear boundaries. My thoughts looped and I worried late into the night. I close the day feeling a little clearer about who I am."
  },
  "IQnFQj-A": {
    "ocean": "O2 C2 E1 A3 N1",
    "mbti": "IQnFQj-A",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. A flexible routine helps me stay productive without feeling boxed in. I listen more than I speak and prefer thoughtful conversation to small talk. Compassion guides many of my decisions, even the small ones. I slept well and my thoughts felt steady throughout the day. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "IQnFQj-Qt": {
    "ocean": "O2 C2 E1 A3 N2",
    "mbti": "IQnFQj-Qt",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. A flexible routine helps me stay productive without feeling boxed in. I find energy in reflection rather than crowds. Compassion guides many of my decisions, even the small ones. I had a few worries that nudged at me, but I managed them sensibly. Writing this down feels like setting a small compass for tomorrow."
  },
  "IQnFQj-T": {
    "ocean": "O2 C2 E1 A3 N3",
    "mbti": "IQnFQj-T",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. A flexible routine helps me stay productive without feeling boxed in. I find energy in reflection rather than crowds. I find meaning in creating warmth and support for friends and family. Worry shadowed much of the day, making routine feel heavy. I tuck this away, grateful for the small lessons it holds."
  },
  "QeQnTQj-A": {
    "ocean": "O2 C2 E2 A1 N1",
    "mbti": "QeQnTQj-A",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. I aim for balance between schedules and spontaneity. I move between social energy and quiet reflection, depending on the day. Practical solutions matter more to me than preserving feelings at all costs. I slept well and my thoughts felt steady throughout the day. Writing this down feels like setting a small compass for tomorrow."
  },
  "QeQnTQj-Qt": {
    "ocean": "O2 C2 E2 A1 N2",
    "mbti": "QeQnTQj-Qt",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I aim for balance between schedules and spontaneity. I move between social energy and quiet reflection, depending on the day. I speak directly and prefer honesty over gentle sugarcoating. I had a few worries that nudged at me, but I managed them sensibly. Each note is a small map of my slow, steady changes."
  },
  "QeQnTQj-T": {
    "ocean": "O2 C2 E2 A1 N3",
    "mbti": "QeQnTQj-T",
    "journal": "I like ideas that blend imagination with usefulness. I set loose plans that keep me steady but allow room for change. I move between social energy and quiet reflection, depending on the day. I’m straightforward, which some find harsh but I call it clarity. My thoughts looped and I worried late into the night. I tuck this away, grateful for the small lessons it holds."
  },
  "QeQnQfQj-A": {
    "ocean": "O2 C2 E2 A2 N1",
    "mbti": "QeQnQfQj-A",
    "journal": "I like ideas that blend imagination with usefulness. I set loose plans that keep me steady but allow room for change. Sometimes I lead, sometimes I step back — both feel natural to me. I try to be kind while also being honest about what I need. I slept well and my thoughts felt steady throughout the day. I tuck this away, grateful for the small lessons it holds."
  },
  "QeQnQfQj-Qt": {
    "ocean": "O2 C2 E2 A2 N2",
    "mbti": "QeQnQfQj-Qt",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. A flexible routine helps me stay productive without feeling boxed in. Sometimes I lead, sometimes I step back — both feel natural to me. I value both fairness and warmth, trying to balance them in action. Some tension appeared, yet I found ways to ease it by evening. Each note is a small map of my slow, steady changes."
  },
  "QeQnQfQj-T": {
    "ocean": "O2 C2 E2 A2 N3",
    "mbti": "QeQnQfQj-T",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. I aim for balance between schedules and spontaneity. I move between social energy and quiet reflection, depending on the day. I try to be kind while also being honest about what I need. My thoughts looped and I worried late into the night. I tuck this away, grateful for the small lessons it holds."
  },
  "QeQnFQj-A": {
    "ocean": "O2 C2 E2 A3 N1",
    "mbti": "QeQnFQj-A",
    "journal": "I like ideas that blend imagination with usefulness. A flexible routine helps me stay productive without feeling boxed in. Sometimes I lead, sometimes I step back — both feel natural to me. Compassion guides many of my decisions, even the small ones. Small setbacks rolled off me easily and didn’t disturb my focus. Writing this down feels like setting a small compass for tomorrow."
  },
  "QeQnFQj-Qt": {
    "ocean": "O2 C2 E2 A3 N2",
    "mbti": "QeQnFQj-Qt",
    "journal": "I like ideas that blend imagination with usefulness. A flexible routine helps me stay productive without feeling boxed in. I enjoy company but also value moments of solitude to regroup. Compassion guides many of my decisions, even the small ones. I had a few worries that nudged at me, but I managed them sensibly. I tuck this away, grateful for the small lessons it holds."
  },
  "QeQnFQj-T": {
    "ocean": "O2 C2 E2 A3 N3",
    "mbti": "QeQnFQj-T",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. A flexible routine helps me stay productive without feeling boxed in. I enjoy company but also value moments of solitude to regroup. Compassion guides many of my decisions, even the small ones. My thoughts looped and I worried late into the night. Each note is a small map of my slow, steady changes."
  },
  "EQnTQj-A": {
    "ocean": "O2 C2 E3 A1 N1",
    "mbti": "EQnTQj-A",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I set loose plans that keep me steady but allow room for change. Connection with others lifts my mood and sharpens my focus. I’m straightforward, which some find harsh but I call it clarity. Small setbacks rolled off me easily and didn’t disturb my focus. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "EQnTQj-Qt": {
    "ocean": "O2 C2 E3 A1 N2",
    "mbti": "EQnTQj-Qt",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I aim for balance between schedules and spontaneity. Connection with others lifts my mood and sharpens my focus. Practical solutions matter more to me than preserving feelings at all costs. There were moments of stress, but not enough to derail the day. I close the day feeling a little clearer about who I am."
  },
  "EQnTQj-T": {
    "ocean": "O2 C2 E3 A1 N3",
    "mbti": "EQnTQj-T",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. I set loose plans that keep me steady but allow room for change. Being around people fuels me; I catch energy from laughter and chatter. I’m straightforward, which some find harsh but I call it clarity. Worry shadowed much of the day, making routine feel heavy. Writing this down feels like setting a small compass for tomorrow."
  },
  "EQnQfQj-A": {
    "ocean": "O2 C2 E3 A2 N1",
    "mbti": "EQnQfQj-A",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. A flexible routine helps me stay productive without feeling boxed in. Being around people fuels me; I catch energy from laughter and chatter. I try to be kind while also being honest about what I need. A calm mood carried me through ordinary tasks without drama. I tuck this away, grateful for the small lessons it holds."
  },
  "EQnQfQj-Qt": {
    "ocean": "O2 C2 E3 A2 N2",
    "mbti": "EQnQfQj-Qt",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I set loose plans that keep me steady but allow room for change. Connection with others lifts my mood and sharpens my focus. I try to be kind while also being honest about what I need. There were moments of stress, but not enough to derail the day. I tuck this away, grateful for the small lessons it holds."
  },
  "EQnQfQj-T": {
    "ocean": "O2 C2 E3 A2 N3",
    "mbti": "EQnQfQj-T",
    "journal": "I like ideas that blend imagination with usefulness. A flexible routine helps me stay productive without feeling boxed in. I often start conversations and find the center of the room energizing. I try to be kind while also being honest about what I need. Anxiety kept me awake and made small problems feel very large. Writing this down feels like setting a small compass for tomorrow."
  },
  "EQnFQj-A": {
    "ocean": "O2 C2 E3 A3 N1",
    "mbti": "EQnFQj-A",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. A flexible routine helps me stay productive without feeling boxed in. I often start conversations and find the center of the room energizing. I find meaning in creating warmth and support for friends and family. Small setbacks rolled off me easily and didn’t disturb my focus. I close the day feeling a little clearer about who I am."
  },
  "EQnFQj-Qt": {
    "ocean": "O2 C2 E3 A3 N2",
    "mbti": "EQnFQj-Qt",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. A flexible routine helps me stay productive without feeling boxed in. Being around people fuels me; I catch energy from laughter and chatter. Compassion guides many of my decisions, even the small ones. I had a few worries that nudged at me, but I managed them sensibly. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "EQnFQj-T": {
    "ocean": "O2 C2 E3 A3 N3",
    "mbti": "EQnFQj-T",
    "journal": "I like ideas that blend imagination with usefulness. I set loose plans that keep me steady but allow room for change. Being around people fuels me; I catch energy from laughter and chatter. I notice when others struggle and naturally step in to help. Worry shadowed much of the day, making routine feel heavy. Each note is a small map of my slow, steady changes."
  },
  "IQnTJ-A": {
    "ocean": "O2 C3 E1 A1 N1",
    "mbti": "IQnTJ-A",
    "journal": "I like ideas that blend imagination with usefulness. I like to measure progress and tidy up unfinished work. Solitude restores me; I often need quiet time to recharge. Practical solutions matter more to me than preserving feelings at all costs. Small setbacks rolled off me easily and didn’t disturb my focus. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "IQnTJ-Qt": {
    "ocean": "O2 C3 E1 A1 N2",
    "mbti": "IQnTJ-Qt",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I like to measure progress and tidy up unfinished work. I listen more than I speak and prefer thoughtful conversation to small talk. Practical solutions matter more to me than preserving feelings at all costs. Some tension appeared, yet I found ways to ease it by evening. Each note is a small map of my slow, steady changes."
  },
  "IQnTJ-T": {
    "ocean": "O2 C3 E1 A1 N3",
    "mbti": "IQnTJ-T",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I get satisfaction from finishing tasks and keeping clear lists. I find energy in reflection rather than crowds. I’m straightforward, which some find harsh but I call it clarity. Anxiety kept me awake and made small problems feel very large. I close the day feeling a little clearer about who I am."
  },
  "IQnQfJ-A": {
    "ocean": "O2 C3 E1 A2 N1",
    "mbti": "IQnQfJ-A",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. Plans anchor me; I break big goals into small, achievable steps. I listen more than I speak and prefer thoughtful conversation to small talk. I value both fairness and warmth, trying to balance them in action. A calm mood carried me through ordinary tasks without drama. Each note is a small map of my slow, steady changes."
  },
  "IQnQfJ-Qt": {
    "ocean": "O2 C3 E1 A2 N2",
    "mbti": "IQnQfJ-Qt",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I get satisfaction from finishing tasks and keeping clear lists. I find energy in reflection rather than crowds. I care about people but I also keep clear boundaries. I had a few worries that nudged at me, but I managed them sensibly. Writing this down feels like setting a small compass for tomorrow."
  },
  "IQnQfJ-T": {
    "ocean": "O2 C3 E1 A2 N3",
    "mbti": "IQnQfJ-T",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I like to measure progress and tidy up unfinished work. Solitude restores me; I often need quiet time to recharge. I care about people but I also keep clear boundaries. My thoughts looped and I worried late into the night. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "IQnFJ-A": {
    "ocean": "O2 C3 E1 A3 N1",
    "mbti": "IQnFJ-A",
    "journal": "I like ideas that blend imagination with usefulness. I like to measure progress and tidy up unfinished work. Solitude restores me; I often need quiet time to recharge. Compassion guides many of my decisions, even the small ones. Small setbacks rolled off me easily and didn’t disturb my focus. I close the day feeling a little clearer about who I am."
  },
  "IQnFJ-Qt": {
    "ocean": "O2 C3 E1 A3 N2",
    "mbti": "IQnFJ-Qt",
    "journal": "I like ideas that blend imagination with usefulness. I like to measure progress and tidy up unfinished work. Solitude restores me; I often need quiet time to recharge. I notice when others struggle and naturally step in to help. There were moments of stress, but not enough to derail the day. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "IQnFJ-T": {
    "ocean": "O2 C3 E1 A3 N3",
    "mbti": "IQnFJ-T",
    "journal": "I like ideas that blend imagination with usefulness. I like to measure progress and tidy up unfinished work. Solitude restores me; I often need quiet time to recharge. Compassion guides many of my decisions, even the small ones. Worry shadowed much of the day, making routine feel heavy. I close the day feeling a little clearer about who I am."
  },
  "QeQnTJ-A": {
    "ocean": "O2 C3 E2 A1 N1",
    "mbti": "QeQnTJ-A",
    "journal": "I like ideas that blend imagination with usefulness. I get satisfaction from finishing tasks and keeping clear lists. Sometimes I lead, sometimes I step back — both feel natural to me. I speak directly and prefer honesty over gentle sugarcoating. I slept well and my thoughts felt steady throughout the day. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "QeQnTJ-Qt": {
    "ocean": "O2 C3 E2 A1 N2",
    "mbti": "QeQnTJ-Qt",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I like to measure progress and tidy up unfinished work. I move between social energy and quiet reflection, depending on the day. I speak directly and prefer honesty over gentle sugarcoating. I had a few worries that nudged at me, but I managed them sensibly. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "QeQnTJ-T": {
    "ocean": "O2 C3 E2 A1 N3",
    "mbti": "QeQnTJ-T",
    "journal": "I like ideas that blend imagination with usefulness. I get satisfaction from finishing tasks and keeping clear lists. I enjoy company but also value moments of solitude to regroup. I’m straightforward, which some find harsh but I call it clarity. My thoughts looped and I worried late into the night. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "QeQnQfJ-A": {
    "ocean": "O2 C3 E2 A2 N1",
    "mbti": "QeQnQfJ-A",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. Plans anchor me; I break big goals into small, achievable steps. I move between social energy and quiet reflection, depending on the day. I value both fairness and warmth, trying to balance them in action. A calm mood carried me through ordinary tasks without drama. I tuck this away, grateful for the small lessons it holds."
  },
  "QeQnQfJ-Qt": {
    "ocean": "O2 C3 E2 A2 N2",
    "mbti": "QeQnQfJ-Qt",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. I get satisfaction from finishing tasks and keeping clear lists. I move between social energy and quiet reflection, depending on the day. I value both fairness and warmth, trying to balance them in action. I had a few worries that nudged at me, but I managed them sensibly. Writing this down feels like setting a small compass for tomorrow."
  },
  "QeQnQfJ-T": {
    "ocean": "O2 C3 E2 A2 N3",
    "mbti": "QeQnQfJ-T",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I like to measure progress and tidy up unfinished work. I move between social energy and quiet reflection, depending on the day. I try to be kind while also being honest about what I need. Worry shadowed much of the day, making routine feel heavy. I close the day feeling a little clearer about who I am."
  },
  "QeQnFJ-A": {
    "ocean": "O2 C3 E2 A3 N1",
    "mbti": "QeQnFJ-A",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I get satisfaction from finishing tasks and keeping clear lists. I move between social energy and quiet reflection, depending on the day. I find meaning in creating warmth and support for friends and family. A calm mood carried me through ordinary tasks without drama. I close the day feeling a little clearer about who I am."
  },
  "QeQnFJ-Qt": {
    "ocean": "O2 C3 E2 A3 N2",
    "mbti": "QeQnFJ-Qt",
    "journal": "I like ideas that blend imagination with usefulness. Plans anchor me; I break big goals into small, achievable steps. I enjoy company but also value moments of solitude to regroup. I find meaning in creating warmth and support for friends and family. I had a few worries that nudged at me, but I managed them sensibly. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "QeQnFJ-T": {
    "ocean": "O2 C3 E2 A3 N3",
    "mbti": "QeQnFJ-T",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. Plans anchor me; I break big goals into small, achievable steps. Sometimes I lead, sometimes I step back — both feel natural to me. I notice when others struggle and naturally step in to help. Anxiety kept me awake and made small problems feel very large. I close the day feeling a little clearer about who I am."
  },
  "EQnTJ-A": {
    "ocean": "O2 C3 E3 A1 N1",
    "mbti": "EQnTJ-A",
    "journal": "I like ideas that blend imagination with usefulness. Plans anchor me; I break big goals into small, achievable steps. Connection with others lifts my mood and sharpens my focus. I speak directly and prefer honesty over gentle sugarcoating. Small setbacks rolled off me easily and didn’t disturb my focus. Writing this down feels like setting a small compass for tomorrow."
  },
  "EQnTJ-Qt": {
    "ocean": "O2 C3 E3 A1 N2",
    "mbti": "EQnTJ-Qt",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. Plans anchor me; I break big goals into small, achievable steps. Connection with others lifts my mood and sharpens my focus. Practical solutions matter more to me than preserving feelings at all costs. I had a few worries that nudged at me, but I managed them sensibly. Each note is a small map of my slow, steady changes."
  },
  "EQnTJ-T": {
    "ocean": "O2 C3 E3 A1 N3",
    "mbti": "EQnTJ-T",
    "journal": "I like ideas that blend imagination with usefulness. Plans anchor me; I break big goals into small, achievable steps. Being around people fuels me; I catch energy from laughter and chatter. Practical solutions matter more to me than preserving feelings at all costs. My thoughts looped and I worried late into the night. I tuck this away, grateful for the small lessons it holds."
  },
  "EQnQfJ-A": {
    "ocean": "O2 C3 E3 A2 N1",
    "mbti": "EQnQfJ-A",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. I get satisfaction from finishing tasks and keeping clear lists. I often start conversations and find the center of the room energizing. I care about people but I also keep clear boundaries. I slept well and my thoughts felt steady throughout the day. I close the day feeling a little clearer about who I am."
  },
  "EQnQfJ-Qt": {
    "ocean": "O2 C3 E3 A2 N2",
    "mbti": "EQnQfJ-Qt",
    "journal": "I like ideas that blend imagination with usefulness. Plans anchor me; I break big goals into small, achievable steps. Being around people fuels me; I catch energy from laughter and chatter. I value both fairness and warmth, trying to balance them in action. I had a few worries that nudged at me, but I managed them sensibly. Writing this down feels like setting a small compass for tomorrow."
  },
  "EQnQfJ-T": {
    "ocean": "O2 C3 E3 A2 N3",
    "mbti": "EQnQfJ-T",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. Plans anchor me; I break big goals into small, achievable steps. Connection with others lifts my mood and sharpens my focus. I value both fairness and warmth, trying to balance them in action. My thoughts looped and I worried late into the night. Each note is a small map of my slow, steady changes."
  },
  "EQnFJ-A": {
    "ocean": "O2 C3 E3 A3 N1",
    "mbti": "EQnFJ-A",
    "journal": "I enjoy a mix of novelty and routine, savoring both stability and surprise. Plans anchor me; I break big goals into small, achievable steps. Connection with others lifts my mood and sharpens my focus. I find meaning in creating warmth and support for friends and family. A calm mood carried me through ordinary tasks without drama. I close the day feeling a little clearer about who I am."
  },
  "EQnFJ-Qt": {
    "ocean": "O2 C3 E3 A3 N2",
    "mbti": "EQnFJ-Qt",
    "journal": "Sometimes I chase new experiences, other times I hold to what’s proven. I like to measure progress and tidy up unfinished work. I often start conversations and find the center of the room energizing. Compassion guides many of my decisions, even the small ones. Some tension appeared, yet I found ways to ease it by evening. Each note is a small map of my slow, steady changes."
  },
  "EQnFJ-T": {
    "ocean": "O2 C3 E3 A3 N3",
    "mbti": "EQnFJ-T",
    "journal": "I like ideas that blend imagination with usefulness. I like to measure progress and tidy up unfinished work. I often start conversations and find the center of the room energizing. Compassion guides many of my decisions, even the small ones. My thoughts looped and I worried late into the night. Each note is a small map of my slow, steady changes."
  },
  "INTP-A": {
    "ocean": "O3 C1 E1 A1 N1",
    "mbti": "INTP-A",
    "journal": "My mind searches for new patterns and delights in strange possibilities. I follow my instincts rather than sticking to tidy timetables. I listen more than I speak and prefer thoughtful conversation to small talk. I speak directly and prefer honesty over gentle sugarcoating. I slept well and my thoughts felt steady throughout the day. Each note is a small map of my slow, steady changes."
  },
  "INTP-Qt": {
    "ocean": "O3 C1 E1 A1 N2",
    "mbti": "INTP-Qt",
    "journal": "My mind searches for new patterns and delights in strange possibilities. I let the day unfold and trust momentum more than strict plans. I find energy in reflection rather than crowds. I speak directly and prefer honesty over gentle sugarcoating. Some tension appeared, yet I found ways to ease it by evening. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "INTP-T": {
    "ocean": "O3 C1 E1 A1 N3",
    "mbti": "INTP-T",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I follow my instincts rather than sticking to tidy timetables. I listen more than I speak and prefer thoughtful conversation to small talk. I’m straightforward, which some find harsh but I call it clarity. Worry shadowed much of the day, making routine feel heavy. I tuck this away, grateful for the small lessons it holds."
  },
  "INQfP-A": {
    "ocean": "O3 C1 E1 A2 N1",
    "mbti": "INQfP-A",
    "journal": "I often daydream about faraway things and how they might connect to my life. I follow my instincts rather than sticking to tidy timetables. I listen more than I speak and prefer thoughtful conversation to small talk. I value both fairness and warmth, trying to balance them in action. Small setbacks rolled off me easily and didn’t disturb my focus. Writing this down feels like setting a small compass for tomorrow."
  },
  "INQfP-Qt": {
    "ocean": "O3 C1 E1 A2 N2",
    "mbti": "INQfP-Qt",
    "journal": "My mind searches for new patterns and delights in strange possibilities. Schedules feel constraining; I value freedom to respond to the moment. I listen more than I speak and prefer thoughtful conversation to small talk. I try to be kind while also being honest about what I need. I had a few worries that nudged at me, but I managed them sensibly. Writing this down feels like setting a small compass for tomorrow."
  },
  "INQfP-T": {
    "ocean": "O3 C1 E1 A2 N3",
    "mbti": "INQfP-T",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I let the day unfold and trust momentum more than strict plans. I find energy in reflection rather than crowds. I value both fairness and warmth, trying to balance them in action. Worry shadowed much of the day, making routine feel heavy. I close the day feeling a little clearer about who I am."
  },
  "INFP-A": {
    "ocean": "O3 C1 E1 A3 N1",
    "mbti": "INFP-A",
    "journal": "My mind searches for new patterns and delights in strange possibilities. I let the day unfold and trust momentum more than strict plans. I listen more than I speak and prefer thoughtful conversation to small talk. I notice when others struggle and naturally step in to help. I slept well and my thoughts felt steady throughout the day. Each note is a small map of my slow, steady changes."
  },
  "INFP-Qt": {
    "ocean": "O3 C1 E1 A3 N2",
    "mbti": "INFP-Qt",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I follow my instincts rather than sticking to tidy timetables. I listen more than I speak and prefer thoughtful conversation to small talk. I find meaning in creating warmth and support for friends and family. Some tension appeared, yet I found ways to ease it by evening. Writing this down feels like setting a small compass for tomorrow."
  },
  "INFP-T": {
    "ocean": "O3 C1 E1 A3 N3",
    "mbti": "INFP-T",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I follow my instincts rather than sticking to tidy timetables. Solitude restores me; I often need quiet time to recharge. Compassion guides many of my decisions, even the small ones. Worry shadowed much of the day, making routine feel heavy. I tuck this away, grateful for the small lessons it holds."
  },
  "QeNTP-A": {
    "ocean": "O3 C1 E2 A1 N1",
    "mbti": "QeNTP-A",
    "journal": "My mind searches for new patterns and delights in strange possibilities. Schedules feel constraining; I value freedom to respond to the moment. I enjoy company but also value moments of solitude to regroup. I speak directly and prefer honesty over gentle sugarcoating. I slept well and my thoughts felt steady throughout the day. Each note is a small map of my slow, steady changes."
  },
  "QeNTP-Qt": {
    "ocean": "O3 C1 E2 A1 N2",
    "mbti": "QeNTP-Qt",
    "journal": "My mind searches for new patterns and delights in strange possibilities. Schedules feel constraining; I value freedom to respond to the moment. I enjoy company but also value moments of solitude to regroup. I’m straightforward, which some find harsh but I call it clarity. There were moments of stress, but not enough to derail the day. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "QeNTP-T": {
    "ocean": "O3 C1 E2 A1 N3",
    "mbti": "QeNTP-T",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I follow my instincts rather than sticking to tidy timetables. I move between social energy and quiet reflection, depending on the day. Practical solutions matter more to me than preserving feelings at all costs. My thoughts looped and I worried late into the night. Writing this down feels like setting a small compass for tomorrow."
  },
  "QeNQfP-A": {
    "ocean": "O3 C1 E2 A2 N1",
    "mbti": "QeNQfP-A",
    "journal": "My mind searches for new patterns and delights in strange possibilities. I follow my instincts rather than sticking to tidy timetables. I move between social energy and quiet reflection, depending on the day. I value both fairness and warmth, trying to balance them in action. A calm mood carried me through ordinary tasks without drama. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "QeNQfP-Qt": {
    "ocean": "O3 C1 E2 A2 N2",
    "mbti": "QeNQfP-Qt",
    "journal": "I often daydream about faraway things and how they might connect to my life. I let the day unfold and trust momentum more than strict plans. I move between social energy and quiet reflection, depending on the day. I value both fairness and warmth, trying to balance them in action. There were moments of stress, but not enough to derail the day. I close the day feeling a little clearer about who I am."
  },
  "QeNQfP-T": {
    "ocean": "O3 C1 E2 A2 N3",
    "mbti": "QeNQfP-T",
    "journal": "My mind searches for new patterns and delights in strange possibilities. I let the day unfold and trust momentum more than strict plans. I enjoy company but also value moments of solitude to regroup. I try to be kind while also being honest about what I need. My thoughts looped and I worried late into the night. Writing this down feels like setting a small compass for tomorrow."
  },
  "QeNFP-A": {
    "ocean": "O3 C1 E2 A3 N1",
    "mbti": "QeNFP-A",
    "journal": "My mind searches for new patterns and delights in strange possibilities. I follow my instincts rather than sticking to tidy timetables. I move between social energy and quiet reflection, depending on the day. Compassion guides many of my decisions, even the small ones. Small setbacks rolled off me easily and didn’t disturb my focus. I close the day feeling a little clearer about who I am."
  },
  "QeNFP-Qt": {
    "ocean": "O3 C1 E2 A3 N2",
    "mbti": "QeNFP-Qt",
    "journal": "My mind searches for new patterns and delights in strange possibilities. Schedules feel constraining; I value freedom to respond to the moment. I move between social energy and quiet reflection, depending on the day. I find meaning in creating warmth and support for friends and family. Some tension appeared, yet I found ways to ease it by evening. I tuck this away, grateful for the small lessons it holds."
  },
  "QeNFP-T": {
    "ocean": "O3 C1 E2 A3 N3",
    "mbti": "QeNFP-T",
    "journal": "I often daydream about faraway things and how they might connect to my life. I let the day unfold and trust momentum more than strict plans. I enjoy company but also value moments of solitude to regroup. Compassion guides many of my decisions, even the small ones. Anxiety kept me awake and made small problems feel very large. I tuck this away, grateful for the small lessons it holds."
  },
  "ENTP-A": {
    "ocean": "O3 C1 E3 A1 N1",
    "mbti": "ENTP-A",
    "journal": "I often daydream about faraway things and how they might connect to my life. I follow my instincts rather than sticking to tidy timetables. Connection with others lifts my mood and sharpens my focus. I speak directly and prefer honesty over gentle sugarcoating. Small setbacks rolled off me easily and didn’t disturb my focus. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ENTP-Qt": {
    "ocean": "O3 C1 E3 A1 N2",
    "mbti": "ENTP-Qt",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. Schedules feel constraining; I value freedom to respond to the moment. Being around people fuels me; I catch energy from laughter and chatter. I’m straightforward, which some find harsh but I call it clarity. I had a few worries that nudged at me, but I managed them sensibly. I close the day feeling a little clearer about who I am."
  },
  "ENTP-T": {
    "ocean": "O3 C1 E3 A1 N3",
    "mbti": "ENTP-T",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I follow my instincts rather than sticking to tidy timetables. Connection with others lifts my mood and sharpens my focus. Practical solutions matter more to me than preserving feelings at all costs. My thoughts looped and I worried late into the night. Each note is a small map of my slow, steady changes."
  },
  "ENQfP-A": {
    "ocean": "O3 C1 E3 A2 N1",
    "mbti": "ENQfP-A",
    "journal": "My mind searches for new patterns and delights in strange possibilities. I let the day unfold and trust momentum more than strict plans. I often start conversations and find the center of the room energizing. I care about people but I also keep clear boundaries. Small setbacks rolled off me easily and didn’t disturb my focus. Writing this down feels like setting a small compass for tomorrow."
  },
  "ENQfP-Qt": {
    "ocean": "O3 C1 E3 A2 N2",
    "mbti": "ENQfP-Qt",
    "journal": "My mind searches for new patterns and delights in strange possibilities. Schedules feel constraining; I value freedom to respond to the moment. Being around people fuels me; I catch energy from laughter and chatter. I value both fairness and warmth, trying to balance them in action. There were moments of stress, but not enough to derail the day. I close the day feeling a little clearer about who I am."
  },
  "ENQfP-T": {
    "ocean": "O3 C1 E3 A2 N3",
    "mbti": "ENQfP-T",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I follow my instincts rather than sticking to tidy timetables. Being around people fuels me; I catch energy from laughter and chatter. I care about people but I also keep clear boundaries. Anxiety kept me awake and made small problems feel very large. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ENFP-A": {
    "ocean": "O3 C1 E3 A3 N1",
    "mbti": "ENFP-A",
    "journal": "My mind searches for new patterns and delights in strange possibilities. I let the day unfold and trust momentum more than strict plans. I often start conversations and find the center of the room energizing. I find meaning in creating warmth and support for friends and family. I slept well and my thoughts felt steady throughout the day. I tuck this away, grateful for the small lessons it holds."
  },
  "ENFP-Qt": {
    "ocean": "O3 C1 E3 A3 N2",
    "mbti": "ENFP-Qt",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I let the day unfold and trust momentum more than strict plans. Connection with others lifts my mood and sharpens my focus. I find meaning in creating warmth and support for friends and family. Some tension appeared, yet I found ways to ease it by evening. Writing this down feels like setting a small compass for tomorrow."
  },
  "ENFP-T": {
    "ocean": "O3 C1 E3 A3 N3",
    "mbti": "ENFP-T",
    "journal": "I often daydream about faraway things and how they might connect to my life. Schedules feel constraining; I value freedom to respond to the moment. Connection with others lifts my mood and sharpens my focus. Compassion guides many of my decisions, even the small ones. Worry shadowed much of the day, making routine feel heavy. I close the day feeling a little clearer about who I am."
  },
  "INTQj-A": {
    "ocean": "O3 C2 E1 A1 N1",
    "mbti": "INTQj-A",
    "journal": "I often daydream about faraway things and how they might connect to my life. A flexible routine helps me stay productive without feeling boxed in. I find energy in reflection rather than crowds. I speak directly and prefer honesty over gentle sugarcoating. A calm mood carried me through ordinary tasks without drama. Each note is a small map of my slow, steady changes."
  },
  "INTQj-Qt": {
    "ocean": "O3 C2 E1 A1 N2",
    "mbti": "INTQj-Qt",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I aim for balance between schedules and spontaneity. I listen more than I speak and prefer thoughtful conversation to small talk. Practical solutions matter more to me than preserving feelings at all costs. Some tension appeared, yet I found ways to ease it by evening. Each note is a small map of my slow, steady changes."
  },
  "INTQj-T": {
    "ocean": "O3 C2 E1 A1 N3",
    "mbti": "INTQj-T",
    "journal": "My mind searches for new patterns and delights in strange possibilities. I set loose plans that keep me steady but allow room for change. I find energy in reflection rather than crowds. Practical solutions matter more to me than preserving feelings at all costs. My thoughts looped and I worried late into the night. I tuck this away, grateful for the small lessons it holds."
  },
  "INQfQj-A": {
    "ocean": "O3 C2 E1 A2 N1",
    "mbti": "INQfQj-A",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I aim for balance between schedules and spontaneity. Solitude restores me; I often need quiet time to recharge. I value both fairness and warmth, trying to balance them in action. Small setbacks rolled off me easily and didn’t disturb my focus. Writing this down feels like setting a small compass for tomorrow."
  },
  "INQfQj-Qt": {
    "ocean": "O3 C2 E1 A2 N2",
    "mbti": "INQfQj-Qt",
    "journal": "I often daydream about faraway things and how they might connect to my life. I set loose plans that keep me steady but allow room for change. I listen more than I speak and prefer thoughtful conversation to small talk. I care about people but I also keep clear boundaries. There were moments of stress, but not enough to derail the day. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "INQfQj-T": {
    "ocean": "O3 C2 E1 A2 N3",
    "mbti": "INQfQj-T",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. A flexible routine helps me stay productive without feeling boxed in. I find energy in reflection rather than crowds. I care about people but I also keep clear boundaries. My thoughts looped and I worried late into the night. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "INFQj-A": {
    "ocean": "O3 C2 E1 A3 N1",
    "mbti": "INFQj-A",
    "journal": "I often daydream about faraway things and how they might connect to my life. I aim for balance between schedules and spontaneity. I listen more than I speak and prefer thoughtful conversation to small talk. Compassion guides many of my decisions, even the small ones. I slept well and my thoughts felt steady throughout the day. I tuck this away, grateful for the small lessons it holds."
  },
  "INFQj-Qt": {
    "ocean": "O3 C2 E1 A3 N2",
    "mbti": "INFQj-Qt",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I aim for balance between schedules and spontaneity. Solitude restores me; I often need quiet time to recharge. Compassion guides many of my decisions, even the small ones. I had a few worries that nudged at me, but I managed them sensibly. I tuck this away, grateful for the small lessons it holds."
  },
  "INFQj-T": {
    "ocean": "O3 C2 E1 A3 N3",
    "mbti": "INFQj-T",
    "journal": "My mind searches for new patterns and delights in strange possibilities. I set loose plans that keep me steady but allow room for change. I find energy in reflection rather than crowds. I notice when others struggle and naturally step in to help. Anxiety kept me awake and made small problems feel very large. I tuck this away, grateful for the small lessons it holds."
  },
  "QeNTQj-A": {
    "ocean": "O3 C2 E2 A1 N1",
    "mbti": "QeNTQj-A",
    "journal": "I often daydream about faraway things and how they might connect to my life. A flexible routine helps me stay productive without feeling boxed in. I move between social energy and quiet reflection, depending on the day. Practical solutions matter more to me than preserving feelings at all costs. I slept well and my thoughts felt steady throughout the day. Each note is a small map of my slow, steady changes."
  },
  "QeNTQj-Qt": {
    "ocean": "O3 C2 E2 A1 N2",
    "mbti": "QeNTQj-Qt",
    "journal": "I often daydream about faraway things and how they might connect to my life. I aim for balance between schedules and spontaneity. I move between social energy and quiet reflection, depending on the day. Practical solutions matter more to me than preserving feelings at all costs. Some tension appeared, yet I found ways to ease it by evening. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "QeNTQj-T": {
    "ocean": "O3 C2 E2 A1 N3",
    "mbti": "QeNTQj-T",
    "journal": "I often daydream about faraway things and how they might connect to my life. I aim for balance between schedules and spontaneity. Sometimes I lead, sometimes I step back — both feel natural to me. Practical solutions matter more to me than preserving feelings at all costs. My thoughts looped and I worried late into the night. Writing this down feels like setting a small compass for tomorrow."
  },
  "QeNQfQj-A": {
    "ocean": "O3 C2 E2 A2 N1",
    "mbti": "QeNQfQj-A",
    "journal": "My mind searches for new patterns and delights in strange possibilities. I aim for balance between schedules and spontaneity. I move between social energy and quiet reflection, depending on the day. I try to be kind while also being honest about what I need. I slept well and my thoughts felt steady throughout the day. I tuck this away, grateful for the small lessons it holds."
  },
  "QeNQfQj-Qt": {
    "ocean": "O3 C2 E2 A2 N2",
    "mbti": "QeNQfQj-Qt",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I aim for balance between schedules and spontaneity. Sometimes I lead, sometimes I step back — both feel natural to me. I try to be kind while also being honest about what I need. There were moments of stress, but not enough to derail the day. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "QeNQfQj-T": {
    "ocean": "O3 C2 E2 A2 N3",
    "mbti": "QeNQfQj-T",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I aim for balance between schedules and spontaneity. Sometimes I lead, sometimes I step back — both feel natural to me. I try to be kind while also being honest about what I need. My thoughts looped and I worried late into the night. Each note is a small map of my slow, steady changes."
  },
  "QeNFQj-A": {
    "ocean": "O3 C2 E2 A3 N1",
    "mbti": "QeNFQj-A",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I aim for balance between schedules and spontaneity. I enjoy company but also value moments of solitude to regroup. Compassion guides many of my decisions, even the small ones. A calm mood carried me through ordinary tasks without drama. I close the day feeling a little clearer about who I am."
  },
  "QeNFQj-Qt": {
    "ocean": "O3 C2 E2 A3 N2",
    "mbti": "QeNFQj-Qt",
    "journal": "My mind searches for new patterns and delights in strange possibilities. I set loose plans that keep me steady but allow room for change. I enjoy company but also value moments of solitude to regroup. I notice when others struggle and naturally step in to help. There were moments of stress, but not enough to derail the day. I tuck this away, grateful for the small lessons it holds."
  },
  "QeNFQj-T": {
    "ocean": "O3 C2 E2 A3 N3",
    "mbti": "QeNFQj-T",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I aim for balance between schedules and spontaneity. I enjoy company but also value moments of solitude to regroup. I find meaning in creating warmth and support for friends and family. Worry shadowed much of the day, making routine feel heavy. I close the day feeling a little clearer about who I am."
  },
  "ENTQj-A": {
    "ocean": "O3 C2 E3 A1 N1",
    "mbti": "ENTQj-A",
    "journal": "I often daydream about faraway things and how they might connect to my life. I set loose plans that keep me steady but allow room for change. Being around people fuels me; I catch energy from laughter and chatter. Practical solutions matter more to me than preserving feelings at all costs. I slept well and my thoughts felt steady throughout the day. I close the day feeling a little clearer about who I am."
  },
  "ENTQj-Qt": {
    "ocean": "O3 C2 E3 A1 N2",
    "mbti": "ENTQj-Qt",
    "journal": "I often daydream about faraway things and how they might connect to my life. I aim for balance between schedules and spontaneity. Being around people fuels me; I catch energy from laughter and chatter. I’m straightforward, which some find harsh but I call it clarity. Some tension appeared, yet I found ways to ease it by evening. I tuck this away, grateful for the small lessons it holds."
  },
  "ENTQj-T": {
    "ocean": "O3 C2 E3 A1 N3",
    "mbti": "ENTQj-T",
    "journal": "My mind searches for new patterns and delights in strange possibilities. I aim for balance between schedules and spontaneity. Connection with others lifts my mood and sharpens my focus. I’m straightforward, which some find harsh but I call it clarity. Anxiety kept me awake and made small problems feel very large. Writing this down feels like setting a small compass for tomorrow."
  },
  "ENQfQj-A": {
    "ocean": "O3 C2 E3 A2 N1",
    "mbti": "ENQfQj-A",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I set loose plans that keep me steady but allow room for change. Being around people fuels me; I catch energy from laughter and chatter. I try to be kind while also being honest about what I need. Small setbacks rolled off me easily and didn’t disturb my focus. Writing this down feels like setting a small compass for tomorrow."
  },
  "ENQfQj-Qt": {
    "ocean": "O3 C2 E3 A2 N2",
    "mbti": "ENQfQj-Qt",
    "journal": "My mind searches for new patterns and delights in strange possibilities. A flexible routine helps me stay productive without feeling boxed in. I often start conversations and find the center of the room energizing. I care about people but I also keep clear boundaries. There were moments of stress, but not enough to derail the day. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ENQfQj-T": {
    "ocean": "O3 C2 E3 A2 N3",
    "mbti": "ENQfQj-T",
    "journal": "I often daydream about faraway things and how they might connect to my life. I aim for balance between schedules and spontaneity. Being around people fuels me; I catch energy from laughter and chatter. I try to be kind while also being honest about what I need. Worry shadowed much of the day, making routine feel heavy. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ENFQj-A": {
    "ocean": "O3 C2 E3 A3 N1",
    "mbti": "ENFQj-A",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I set loose plans that keep me steady but allow room for change. Connection with others lifts my mood and sharpens my focus. I find meaning in creating warmth and support for friends and family. A calm mood carried me through ordinary tasks without drama. Writing this down feels like setting a small compass for tomorrow."
  },
  "ENFQj-Qt": {
    "ocean": "O3 C2 E3 A3 N2",
    "mbti": "ENFQj-Qt",
    "journal": "My mind searches for new patterns and delights in strange possibilities. A flexible routine helps me stay productive without feeling boxed in. Connection with others lifts my mood and sharpens my focus. I notice when others struggle and naturally step in to help. There were moments of stress, but not enough to derail the day. I tuck this away, grateful for the small lessons it holds."
  },
  "ENFQj-T": {
    "ocean": "O3 C2 E3 A3 N3",
    "mbti": "ENFQj-T",
    "journal": "I often daydream about faraway things and how they might connect to my life. I set loose plans that keep me steady but allow room for change. I often start conversations and find the center of the room energizing. Compassion guides many of my decisions, even the small ones. Anxiety kept me awake and made small problems feel very large. I close the day feeling a little clearer about who I am."
  },
  "INTJ-A": {
    "ocean": "O3 C3 E1 A1 N1",
    "mbti": "INTJ-A",
    "journal": "I often daydream about faraway things and how they might connect to my life. I like to measure progress and tidy up unfinished work. I listen more than I speak and prefer thoughtful conversation to small talk. Practical solutions matter more to me than preserving feelings at all costs. A calm mood carried me through ordinary tasks without drama. I close the day feeling a little clearer about who I am."
  },
  "INTJ-Qt": {
    "ocean": "O3 C3 E1 A1 N2",
    "mbti": "INTJ-Qt",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. Plans anchor me; I break big goals into small, achievable steps. Solitude restores me; I often need quiet time to recharge. I’m straightforward, which some find harsh but I call it clarity. Some tension appeared, yet I found ways to ease it by evening. I close the day feeling a little clearer about who I am."
  },
  "INTJ-T": {
    "ocean": "O3 C3 E1 A1 N3",
    "mbti": "INTJ-T",
    "journal": "I often daydream about faraway things and how they might connect to my life. Plans anchor me; I break big goals into small, achievable steps. Solitude restores me; I often need quiet time to recharge. I speak directly and prefer honesty over gentle sugarcoating. Worry shadowed much of the day, making routine feel heavy. I tuck this away, grateful for the small lessons it holds."
  },
  "INQfJ-A": {
    "ocean": "O3 C3 E1 A2 N1",
    "mbti": "INQfJ-A",
    "journal": "My mind searches for new patterns and delights in strange possibilities. Plans anchor me; I break big goals into small, achievable steps. I find energy in reflection rather than crowds. I value both fairness and warmth, trying to balance them in action. Small setbacks rolled off me easily and didn’t disturb my focus. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "INQfJ-Qt": {
    "ocean": "O3 C3 E1 A2 N2",
    "mbti": "INQfJ-Qt",
    "journal": "I often daydream about faraway things and how they might connect to my life. Plans anchor me; I break big goals into small, achievable steps. I listen more than I speak and prefer thoughtful conversation to small talk. I value both fairness and warmth, trying to balance them in action. I had a few worries that nudged at me, but I managed them sensibly. I tuck this away, grateful for the small lessons it holds."
  },
  "INQfJ-T": {
    "ocean": "O3 C3 E1 A2 N3",
    "mbti": "INQfJ-T",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. Plans anchor me; I break big goals into small, achievable steps. Solitude restores me; I often need quiet time to recharge. I try to be kind while also being honest about what I need. Worry shadowed much of the day, making routine feel heavy. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "INFJ-A": {
    "ocean": "O3 C3 E1 A3 N1",
    "mbti": "INFJ-A",
    "journal": "I often daydream about faraway things and how they might connect to my life. Plans anchor me; I break big goals into small, achievable steps. I listen more than I speak and prefer thoughtful conversation to small talk. I find meaning in creating warmth and support for friends and family. A calm mood carried me through ordinary tasks without drama. I tuck this away, grateful for the small lessons it holds."
  },
  "INFJ-Qt": {
    "ocean": "O3 C3 E1 A3 N2",
    "mbti": "INFJ-Qt",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I get satisfaction from finishing tasks and keeping clear lists. I find energy in reflection rather than crowds. I find meaning in creating warmth and support for friends and family. There were moments of stress, but not enough to derail the day. I close the day feeling a little clearer about who I am."
  },
  "INFJ-T": {
    "ocean": "O3 C3 E1 A3 N3",
    "mbti": "INFJ-T",
    "journal": "I often daydream about faraway things and how they might connect to my life. I get satisfaction from finishing tasks and keeping clear lists. Solitude restores me; I often need quiet time to recharge. Compassion guides many of my decisions, even the small ones. My thoughts looped and I worried late into the night. Each note is a small map of my slow, steady changes."
  },
  "QeNTJ-A": {
    "ocean": "O3 C3 E2 A1 N1",
    "mbti": "QeNTJ-A",
    "journal": "I often daydream about faraway things and how they might connect to my life. I like to measure progress and tidy up unfinished work. Sometimes I lead, sometimes I step back — both feel natural to me. I speak directly and prefer honesty over gentle sugarcoating. A calm mood carried me through ordinary tasks without drama. Each note is a small map of my slow, steady changes."
  },
  "QeNTJ-Qt": {
    "ocean": "O3 C3 E2 A1 N2",
    "mbti": "QeNTJ-Qt",
    "journal": "I often daydream about faraway things and how they might connect to my life. I get satisfaction from finishing tasks and keeping clear lists. Sometimes I lead, sometimes I step back — both feel natural to me. I’m straightforward, which some find harsh but I call it clarity. There were moments of stress, but not enough to derail the day. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "QeNTJ-T": {
    "ocean": "O3 C3 E2 A1 N3",
    "mbti": "QeNTJ-T",
    "journal": "I often daydream about faraway things and how they might connect to my life. Plans anchor me; I break big goals into small, achievable steps. I move between social energy and quiet reflection, depending on the day. I’m straightforward, which some find harsh but I call it clarity. Anxiety kept me awake and made small problems feel very large. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "QeNQfJ-A": {
    "ocean": "O3 C3 E2 A2 N1",
    "mbti": "QeNQfJ-A",
    "journal": "I often daydream about faraway things and how they might connect to my life. I like to measure progress and tidy up unfinished work. I enjoy company but also value moments of solitude to regroup. I value both fairness and warmth, trying to balance them in action. Small setbacks rolled off me easily and didn’t disturb my focus. I close the day feeling a little clearer about who I am."
  },
  "QeNQfJ-Qt": {
    "ocean": "O3 C3 E2 A2 N2",
    "mbti": "QeNQfJ-Qt",
    "journal": "I often daydream about faraway things and how they might connect to my life. I get satisfaction from finishing tasks and keeping clear lists. I move between social energy and quiet reflection, depending on the day. I value both fairness and warmth, trying to balance them in action. I had a few worries that nudged at me, but I managed them sensibly. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "QeNQfJ-T": {
    "ocean": "O3 C3 E2 A2 N3",
    "mbti": "QeNQfJ-T",
    "journal": "My mind searches for new patterns and delights in strange possibilities. Plans anchor me; I break big goals into small, achievable steps. Sometimes I lead, sometimes I step back — both feel natural to me. I care about people but I also keep clear boundaries. My thoughts looped and I worried late into the night. Writing this down feels like setting a small compass for tomorrow."
  },
  "QeNFJ-A": {
    "ocean": "O3 C3 E2 A3 N1",
    "mbti": "QeNFJ-A",
    "journal": "My mind searches for new patterns and delights in strange possibilities. Plans anchor me; I break big goals into small, achievable steps. Sometimes I lead, sometimes I step back — both feel natural to me. I notice when others struggle and naturally step in to help. I slept well and my thoughts felt steady throughout the day. Writing this down feels like setting a small compass for tomorrow."
  },
  "QeNFJ-Qt": {
    "ocean": "O3 C3 E2 A3 N2",
    "mbti": "QeNFJ-Qt",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I get satisfaction from finishing tasks and keeping clear lists. I move between social energy and quiet reflection, depending on the day. I find meaning in creating warmth and support for friends and family. Some tension appeared, yet I found ways to ease it by evening. I close the day feeling a little clearer about who I am."
  },
  "QeNFJ-T": {
    "ocean": "O3 C3 E2 A3 N3",
    "mbti": "QeNFJ-T",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I get satisfaction from finishing tasks and keeping clear lists. I enjoy company but also value moments of solitude to regroup. I notice when others struggle and naturally step in to help. Anxiety kept me awake and made small problems feel very large. Writing this down feels like setting a small compass for tomorrow."
  },
  "ENTJ-A": {
    "ocean": "O3 C3 E3 A1 N1",
    "mbti": "ENTJ-A",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. Plans anchor me; I break big goals into small, achievable steps. Connection with others lifts my mood and sharpens my focus. I speak directly and prefer honesty over gentle sugarcoating. Small setbacks rolled off me easily and didn’t disturb my focus. Putting these thoughts on paper helps me make sense of them by morning."
  },
  "ENTJ-Qt": {
    "ocean": "O3 C3 E3 A1 N2",
    "mbti": "ENTJ-Qt",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. Plans anchor me; I break big goals into small, achievable steps. Connection with others lifts my mood and sharpens my focus. I speak directly and prefer honesty over gentle sugarcoating. Some tension appeared, yet I found ways to ease it by evening. Writing this down feels like setting a small compass for tomorrow."
  },
  "ENTJ-T": {
    "ocean": "O3 C3 E3 A1 N3",
    "mbti": "ENTJ-T",
    "journal": "I often daydream about faraway things and how they might connect to my life. Plans anchor me; I break big goals into small, achievable steps. Connection with others lifts my mood and sharpens my focus. Practical solutions matter more to me than preserving feelings at all costs. My thoughts looped and I worried late into the night. Each note is a small map of my slow, steady changes."
  },
  "ENQfJ-A": {
    "ocean": "O3 C3 E3 A2 N1",
    "mbti": "ENQfJ-A",
    "journal": "I often daydream about faraway things and how they might connect to my life. Plans anchor me; I break big goals into small, achievable steps. Connection with others lifts my mood and sharpens my focus. I care about people but I also keep clear boundaries. Small setbacks rolled off me easily and didn’t disturb my focus. Writing this down feels like setting a small compass for tomorrow."
  },
  "ENQfJ-Qt": {
    "ocean": "O3 C3 E3 A2 N2",
    "mbti": "ENQfJ-Qt",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. Plans anchor me; I break big goals into small, achievable steps. Connection with others lifts my mood and sharpens my focus. I try to be kind while also being honest about what I need. There were moments of stress, but not enough to derail the day. I tuck this away, grateful for the small lessons it holds."
  },
  "ENQfJ-T": {
    "ocean": "O3 C3 E3 A2 N3",
    "mbti": "ENQfJ-T",
    "journal": "I often daydream about faraway things and how they might connect to my life. I like to measure progress and tidy up unfinished work. I often start conversations and find the center of the room energizing. I value both fairness and warmth, trying to balance them in action. Worry shadowed much of the day, making routine feel heavy. Each note is a small map of my slow, steady changes."
  },
  "ENFJ-A": {
    "ocean": "O3 C3 E3 A3 N1",
    "mbti": "ENFJ-A",
    "journal": "Curiosity pushes me toward experiments and unexpected discoveries. I get satisfaction from finishing tasks and keeping clear lists. Connection with others lifts my mood and sharpens my focus. I notice when others struggle and naturally step in to help. A calm mood carried me through ordinary tasks without drama. Each note is a small map of my slow, steady changes."
  },
  "ENFJ-Qt": {
    "ocean": "O3 C3 E3 A3 N2",
    "mbti": "ENFJ-Qt",
    "journal": "My mind searches for new patterns and delights in strange possibilities. I get satisfaction from finishing tasks and keeping clear lists. Being around people fuels me; I catch energy from laughter and chatter. I find meaning in creating warmth and support for friends and family. Some tension appeared, yet I found ways to ease it by evening. I tuck this away, grateful for the small lessons it holds."
  },
  "ENFJ-T": {
    "ocean": "O3 C3 E3 A3 N3",
    "mbti": "ENFJ-T",
    "journal": "I often daydream about faraway things and how they might connect to my life. I like to measure progress and tidy up unfinished work. I often start conversations and find the center of the room energizing. I notice when others struggle and naturally step in to help. My thoughts looped and I worried late into the night. Writing this down feels like setting a small compass for tomorrow."
  }
}